Netology/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количественный</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСуммуПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСуммуПриИзменении();
КонецПроцедуры       

&НаКлиенте
Процедура ПересчитатьСуммуПриИзменении()
	
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекущиеДанныеТаблицы.Сумма = ТекущиеДанныеТаблицы.Количество * ТекущиеДанныеТаблицы.Цена;	
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)  
		
	Если НЕ СортировкаПоВозрастанию Тогда 
		Элементы.ТоварыСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВнизКрасная;
		Элементы.ТоварыСортироватьПоСумме.Заголовок = "По возрастанию";
		Объект.Товары.Сортировать("Сумма Убыв");
	Иначе
		Элементы.ТоварыСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВверхЗеленая;
		Элементы.ТоварыСортироватьПоСумме.Заголовок = "По убыванию"; 
		Объект.Товары.Сортировать("Сумма");  
	КонецЕсли;                            
	
	СортировкаПоВозрастанию = НЕ СортировкаПоВозрастанию;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СортировкаПоВозрастанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанныеТаблицы = Неопределено ИЛИ ТекущиеДанныеТаблицы.Цена = Неопределено Тогда
		Возврат;	
	КонецЕсли;   
	
	ТекущиеДанныеТаблицы.Количество = Цел(ТекущиеДанныеТаблицы.Сумма / ТекущиеДанныеТаблицы.Цена);     
							  
	ТекущиеДанныеТаблицы.Сумма = ТекущиеДанныеТаблицы.Количество * ТекущиеДанныеТаблицы.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)                                                              
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком", , Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		СтрокиСНоменклатурой = Новый Структура("Номенклатура", ВыбранныеДанные.Номенклатура);
		ВыбраннаяНоменклатура = Объект.Товары.НайтиСтроки(СтрокиСНоменклатурой);
		Если ВыбраннаяНоменклатура.Количество() = 0 Тогда
			СтрокаТаблицы = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
		Иначе
			НайденнаяСтрока = ВыбраннаяНоменклатура[0];
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ВыбранныеДанные.Количество;
			НайденнаяСтрока.Сумма = НайденнаяСтрока.Количество * НайденнаяСтрока.Цена;
		КонецЕсли;                        
	КонецЦикла;
	
КонецПроцедуры
